OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


# Setup case
./Allrun.pre


#-- Run on single processor

# Agglomerate patch faces
for i in bottomAir topAir
do
    faceAgglomerate -region $i -dict constant/viewFactorsDict > log.faceAgglomerate.$i 2>&1
done

# Generate view factors
for i in bottomAir topAir
do
    viewFactorsGen -region $i > log.viewFactorsGen.$i 2>&1
done

runApplication `getApplication`



echo
echo "creating files for paraview post-processing"
echo
paraFoam -touchAll

# ----------------------------------------------------------------- end-of-file
